code/openfoam/tutorials/fluid/annularThermalMixer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.1;

vertices
(
    (-1.1 -1.1 -0.1)
    ( 1.1 -1.1 -0.1)
    ( 1.1  1.1 -0.1)
    (-1.1  1.1 -0.1)

    (-1.1 -1.1  2.1)
    ( 1.1 -1.1  2.1)
    ( 1.1  1.1  2.1)
    (-1.1  1.1  2.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (21 21 21)
    simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
);


// ************************************************************************* //
